# "//button[contains(text(),'Войти в аккаунт')]" # кнопка "Войти в аккаунт"
# "//a[contains(text(),'Зарегистрироваться')]" # гипертекст 'Зарегистрироваться'
# ".//input[@name='name']" # поле для ввода email
# "//body/div[@id='root']/div[1]/main[1]/div[1]/form[1]/fieldset[2]/div[1]/div[1]/input[1]" # поле "Email"
# ".//input[@type='password']" # поле "Пароль"
# "//button[contains(text(),'Зарегистрироваться')]" # кнопка 'Зарегистрироваться'
# "//p[contains(text(),'Личный Кабинет')]" # кнопка "Личный кабинет"
# "//a[contains(text(),'Восстановить пароль')]"# гипертекст "Восстановить пароль"
# ".//input[@name='name']" # поле для ввода email при входе по кнопке "Войти" и "Личный кабинет"
# "/html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/form[1]/button[1]" # кнопка "Восстановить пароль"
# "//a[contains(text(),'Профиль')]" # кнопка "Профиль" (в личном кабинете)
# "//p[contains(text(),'Конструктор')]" # кнопка "Конструктор"
# "//header/nav[1]/div[1]/a[1]/*[1]" # логотип Stellar Burgers
# "//button[contains(text(),'Выход')]" # кнопка "Выйти" (в личном кабинете)
# "//h2[contains(text(),'Соусы')]" # кнопка "Соусы"
# "//p[contains(text(),'Соус Spicy-X')]" # пример соуса 'Соус Spicy-X'
# "//h2[contains(text(),'Начинки')]" # кнопка "Начинки"
# "//p[contains(text(),'Мясо бессмертных моллюсков Protostomia')]" # пример начинки 'Мясо бессмертных моллюсков Protostomia'
# "//h2[contains(text(),'Булки')]" # кнопка "Булки"
# "//p[contains(text(),'Флюоресцентная булка R2-D3')]" # пример булки 'Флюоресцентная булка R2-D3'

